app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    respond_with Post.all

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "title"], ["content", "content"], ["user_id", 1], ["created_at", "2016-06-17 14:05:20.379138"], ["updated_at", "2016-06-17 14:05:20.379138"]]
---
  def create
    respond_with Post.create(post_params.merge(user_id: current_user.id))